Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །དེ་ལྟ་ཡིན་ཡང་མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དེ་ཡང་བདུན་ཕྲག་བདུན་དུ་བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བྱེད་པ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་འདི་འདིར་ཇི་ལྟར་བསྟན་པ་བཞིན་སྒོམ་པར་བྱེད་ན་བདུན་ཕྲག་བདུན་པོ་དེ་འདས་ནས་ལས་ཀྱི་སྒྲིབ་པ་སུམ་ཆ་མ་ཟད་ཅིང་ལྷག་མ་སྐྱོན་མེད་པར་མ་ལུས་པར་བྱང་བར་འགྱུར་རོ།
en: This being so, even if those who have committed the acts with immediate retribution, abandoned the sacred Dharma, or denigrated the noble ones cultivate for seven weeks, in accordance with the way it is taught here, this recollection of the Buddha that focuses the attention on the four highest abodes, when those seven weeks have passed, not only will a third of their karmic obscurations be exhausted—they will all be purified without remainder.

source: །བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བྱེད་པ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་པ་དེ་ལྟ་བུ་དེ་ནི་དེ་ལྟར་དོན་ཆེ་བ་ཡིན་ནོ།
en: “The cultivation of this recollection of the Buddha that focuses the attention on the four highest abodes is therefore very meaningful.

source: །སུ་ལ་ལ་བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བྱེད་པ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་འདི་དེ་ལྟར་ཐོས་པ་ཙམ་རྣ་ལམ་དུ་ཐོས་ན། དེ་ལ་མིའམ་མི་མ་ཡིན་པའི་བར་དེ་ཉེ་བར་བརྟགས་ནས་དད་པ་དང་། དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་སྐྱེའོ།
en: If this recollection of the Buddha that focuses the attention on the four highest abodes is merely overheard by humans or nonhumans, they will develop faith, joy, and intense delight upon investigating it further.

source: །དེ་བཙོན་རའི་འཆིང་བ་དམ་པོ་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: They will be freed from the tight shackles of their prisons.

source: །གང་སུ་དག་སྡུག་བསྔལ་བར་གྱུར་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྡུག་བསྔལ་དག་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: All those who suffer will be freed from suffering.

source: །ལོངས་སྤྱོད་ཀྱི་སྡུག་བསྔལ་དང་། ཆད་པ་དང་། བརྡེག་པ་དང་། གཡང་ས་དང་། མེ་དང་། ཆུ་དང་། དུག་དང་། དགྲ་ཐམས་ཅད་དང་། འབྱུང་པོ་ཐམས་ཅད་དང་། ནད་ཀྱི་འཇིགས་པ་དང་། གནས་ཀྱི་འཇིགས་པ་དང་། རྒྱལ་པོའི་འཇིགས་པ་དང་ཞེས་བྱ་བ་ནས་བྲན་གྱི་འཇིགས་པ་ཞེས་བྱ་བའི་བར་དང་། ངན་འགྲོར་འགྲོ་བའི་འཇིགས་པ་ཞེས་བྱ་བའི་བར་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: They will be freed from the sufferings related to possessions, punishments, beatings, precipices, fire, water, poison, enemies, and bhūtas and from the fears associated with diseases, places, kings, servants, and the lower realms.

source: །བདེ་འགྲོར་འགྲོ་བའི་རྒྱུར་འགྱུར་རོ།
en: This will be the cause for them to be born within the happy destinies.

source: །སུ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དེ་ལྟ་བུ་ཐོས་པ་ཙམ་རྣ་ལམ་དུ་གྲགས་ན་དེ་ལ་ཉེ་བར་བརྟགས་ནས་དད་པ་སྐྱེས་ཏེ།
en: If someone merely hears this recollection of the Buddha that focuses the attention on the four highest abodes, faith will arise in that person upon examination.

source: དེ་ལྟར་དོན་ཆེ་ཞིང་ཕན་ཡོན་ཆེ་བ་ཡིན་ན་སུ་ཇི་ལྟར་བསྟན་པ་བཞིན་དེ་བཞིན་དུ་བསྒོམ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: This in itself is already highly meaningful and beneficial, let alone cultivating this practice in the way it is taught!”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་སྔོན་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་དཀྲིགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་དྲུག་ནི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་དེ་ཐོབ་པར་གྱུར་ཏོ། །ཇི་ལྟར་སྔར་བཤད་པ་བཞིན་དུ་ཡོན་ཏན་དེ་དག་དང་ཡང་ལྡན་པར་གྱུར་ཏོ།
en: As this Dharma teaching was being delivered, eighty-six quintillion beings who had purified themselves in the past attained the absorption of the Buddha’s recollection and developed the qualities that have been described above.

source: །དེའི་ཚེ་སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ནི་སྡུག་བསྔལ་ལ་ཆོས་ཤེས་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: At that time, eight billion four hundred million beings attained the acceptance of knowing the doctrine of suffering.

source: །དེའི་ཚེ་སེམས་ཅན་དཔག་ཡས་པ་ཁ་ཅིག་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པའི་རྣལ་འབྱོར་དང་འབྲས་བུ་དང་པོ་ལ་གནས་པར་གྱུར་ཏོ། །ཁ་ཅིག་ནི་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་ཐོབ་པར་གྱུར་ཏོ།
en: Among the countless beings present, some settled within the practice of the successive attainments and the first fruition, while others achieved the other fruitions up to the level of a worthy one.

source: །དེའི་ཚེ་སེམས་ཅན་དཔག་ཡས་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྔོན་མ་བསྐྱེད་པའི་སེམས་བསྐྱེད་དོ།
en: At that time, countless beings gave rise to the mind set on unsurpassed and perfect awakening for the first time.

source: །མུན་བྲལ་མ་ལ་སོགས་པའི་བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་བདུད་ཀྱི་གནས་སུ་འཁོད་བཞིན་སེམས་ཡོངས་སུ་སྦྱང་བའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ལུང་བསྟན་པ་འདི་ཐམས་ཅད་ཐོས་སོ།
en: Through the power of the Buddha, the five hundred daughters of Māra, including Free of Darkness, heard this entire teaching on the Buddha’s recollection that purifies the mind even while one is present in the abode of Māra.

source: །ཐོས་ནས་ཀྱང་བུད་མེད་ཀྱི་དངོས་པོ་མི་སྣང་བར་གྱུར་ཏེ་སྐྱེས་པ་ཉིད་ཐོབ་བོ།
en: When they heard it, their female properties disappeared, and they attained male properties.

source: གང་དག་སྔོན་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པར་གྱུར་ཏོ། །ཇི་སྐད་བཤད་པ་བཞིན་དུ་ཡོན་ཏན་དེ་དག་དང་ལྡན་པར་གྱུར་ཏོ།
en: All those among them who had purified themselves in the past achieved the absorption of the Buddha’s recollection and developed the qualities that have been described above.

source: །དེ་དག་ཐམས་ཅད་ཚངས་པ་ཆེན་པོའི་ཆ་བྱད་དུ་བདག་ཉིད་མངོན་པར་སྤྲུལ་ནས་ཚངས་པ་ཆེན་པོ་རེ་རེ་ཡང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོས་མདུན་གྱིས་བལྟས་ཏེ། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་བྱེ་བ་བརྒྱ་ཕྲག་མང་པོས་ཡོངས་སུ་བསྐོར་ནས་དེ་དག་བདུད་ཀྱི་གནས་བསམ་གྱིས་མི་ཁྱབ་པ་བཀོད་པ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་བབས་ཏེ།
en: They all assumed the appearance of mahābrahmās. Each of them was surrounded and attended by retinues of many trillions playing billions of instruments and drums as they flew away from the inconceivable arrays in the abode of Māra and landed in front of the Blessed One.

source: བཅོམ་ལྡན་འདས་དེ་ལ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དག་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དག་དང་། རིན་པོ་ཆེའི་རས་བཅོས་བུ་དང་། ཆོས་གོས་སྣ་ཚོགས་གཏོར་ཅིང་མངོན་པར་གཏོར་ཏེ།
en: They tossed and offered different kinds of divine flowers, garlands, perfumes, ointments, parasols, banners, flags, precious fabrics, and Dharma robes to the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Then they circumambulated him three times, bowed down to his feet, and sat to one side.

source: །འཕགས་པ་འདུས་པ་ཆེན་པོ་ཉི་མའི་སྙིང་པོའི་ལེའུ་བཅུ་གཅིག་པ་ལས་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ལེའུ་སྟེ་དགུ་པ་རྫོགས་སོ།། །།
en: This concludes the chapter called “The Recollection of the Buddha,” the ninth among the eleven chapters included in “The Quintessence of the Sun,” from the noble Great Assembly.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མ་ལ་དགའ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then, the Blessed One said to the bodhisattva great being Jyotīrasa, “Noble son, tell me the message of that group of nāgas.”

source: །རིགས་ཀྱི་བུ་ལག་འགྲོའི་ཚོགས་ཐམས་ཅད་ཀྱི་ཞལ་ཏ་བྱོས་ཤིག་ཅེས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་དང་། ཉོན་མོངས་པ་མེད་པའི་སེམས་ཀྱིས་གསོལ་པ།
en: With a mind devoid of afflictions, Jyotīrasa replied,

source: བཅོམ་ལྡན་འདས་ཀྱིས་དུས་ལགས་ཀྱིས་གཤེགས་ཤིག །
en: “Blessed One, it is time for you to come!

source: བཅོམ་ལྡན་འདས་གང་ཁྱོད་ཀྱིས་མཛད་པ་མཛོད་ཅིག །
en: Blessed One, please perform your deeds!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གང་དེ་བཞིན་གཤེགས་པས་ལག་འགྲོའི་ལས་བསྟན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་འབྱང་བ་ལུང་བསྟན་པ་བཤད་པ་རབ་ཏུ་བསྟན་པའི་དུས་ཡིན་ནོ།
en: The Blessed One replied, “Noble son, it is time for the Thus-Gone One to reveal the inconceivable teaching on the nāgas’ karmic action—the teaching of purification.”

source: །ཡང་དེའི་ཚེ་ལྷ་ཐམས་ཅད་ཅེས་བྱ་བ་ནས་གྲུལ་བུམ་ཐམས་ཅད་ཅེས་བྱ་བའི་བར་དག་མེ་ཏོག་དང་། སྤོས་དང་། རིན་པོ་ཆེ་དང་། རས་བཅོས་བུ་དང་། ཆོས་གོས་དང་། རྒྱན་དང་། སྤུད་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་ཆར་པ་དག་རབ་ཏུ་འབེབས་ཤིང་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་རོལ་མོའི་སྒྲ་འབྱིན་པ་ལ་མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱིས་བསྔགས་པའི་ཡོན་ཏན་གྱིས་བསྟོད་ནས་བཅོམ་ལྡན་འདས་གདན་ལས་མངོན་པར་བཞེངས་ཏེ་རིའི་རྒྱལ་པོ་རི་རབ་ག་ལ་བར་བྱང་ཕྱོགས་སུ་ཉེ་བར་གཤེགས་སོ།
en: At that moment, everyone—from all the gods to all the kumbhāṇḍas—showered rains of flowers, perfumes, precious gems, fine fabrics, Dharma robes, ornaments, embroideries, parasols, banners, and flags and offered music by playing myriads of instruments, and all the humans and nonhumans praised his qualities. Amid all this, the Blessed One stood up and departed toward the north, in the direction of Mount Sumeru.

source: །འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་ཐམས་ཅད་ཀྱིས་ཀྱང་གང་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་ཏེ་རི་རབ་ཀྱི་རྩེ་མོར་གཤེགས་པར་བཞེད་པར་ཤེས་སོ།
en: All the gods of the desire and the form realms understood that the Blessed One wanted to go to the summit of Mount Sumeru attended by his saṅgha of hearers and surrounded by his saṅgha of bodhisattvas.

source: །དེ་ལྟར་རིག་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་རས་བཅོས་བུ་སྣ་ཚོགས་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་མེ་ཏོག་བཀྲམ་པའི་ཐེམ་སྐས་སྤྲུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When he saw this, Brahmā, lord of the Sahā world, manifested a stairway for the Blessed One made of the seven precious substances and covered with various fine fabrics and divine precious flowers.

source: །བཅོམ་ལྡན་འདས་བདག་གི་ཐེམ་སྐས་ལས་གཤེགས་པར་གསོལ།
en: He said, “Blessed One, please proceed on your way by using my stairway!”

source: ལྷའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་རྣམས་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་ཐེམ་སྐས་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མ་སྣ་ཚོགས་བཀྲམ་པ་དག་སྤྲུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The gods of the Heaven of Making Use of Others’ Emanations also manifested for the Blessed One a stairway made of gold from the Jambū River and covered with various powders of the most precious types of sandalwood.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གི་ཐེམ་སྐས་རྣམས་ལས་གཤེགས་པར་གསོལ།
en: They said, “Blessed One, please proceed on your way by using our stairway!”

source: ལྷའི་བུ་འཕྲུལ་དགས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ལྷ་རྫས་ཀྱི་གསེར་གྱི་ཐེམ་སྐས་ཙན་དན་ས་མཆོག་སྣ་ཚོགས་བཀྲམ་པ་སྤྲུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The gods of the Heaven of Delighting in Emanations also manifested for the Blessed One a stairway made of divine gold and covered with bright powders of white sandalwood.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གི་ཐེམ་སྐས་ལས་གཤེགས་པར་གསོལ།
en: They said, “Blessed One, please proceed on your way by using our stairway!”

source: ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ལྷ་རྫས་ཀྱི་བཻ་དཱུརྱའི་ཐེམ་སྐས་དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཙན་དན་གྱི་ཕྱེ་མ་སྣ་ཚོགས་བཀྲམ་པ་སྤྲུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The supreme god of the Heaven of Joy also manifested for the Blessed One a stairway made of divine beryl and covered with bright powders of yellow sandalwood.

source: ལྷའི་བུ་རབ་འཐབ་བྲལ་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ལྷ་རྫས་ཀྱི་བཻ་དཱུརྱའི་ཐེམ་སྐས་ལྷ་རྫས་ཀྱི་ཕྱེ་མ་སྣ་ཚོགས་བཀྲམ་པ་སྤྲུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The supreme god of the Heaven Free from Strife also manifested for the Blessed One a stairway made of divine beryl and covered with bright divine powders.

source: ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་མུ་ཏིག་དམར་པོའི་ཐེམ་སྐས་ལྷ་རྫས་ཀྱི་ཙན་དན་གྱི་ཕྱེ་མ་སྣ་ཚོགས་དང་། རིན་པོ་ཆེའི་དྲ་བ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཁེབས་པ་སྤྲུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Śakra, lord of the gods, also manifested for the Blessed One a stairway made of red pearls and covered with bright powders of divine sandalwood and garlands of precious gems.

source: རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་རྡོའི་སྙིང་པོ་ལས་བྱས་པ་ལྷ་རྫས་ཀྱི་རས་བཅོས་བུ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་ཁེབས་པའི་ཐེམ་སྐས་དེ་ཉིད་སྤྲུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The Four Great Kings also manifested for the Blessed One a stairway made of divine emeralds and covered with a variety of divine fabrics.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གི་ཐེམ་སྐས་ལས་རི་རབ་ཀྱི་རྩེ་མོར་གཤེགས་པར་གསོལ།
en: They said, “Blessed One, please proceed to the summit of Mount Sumeru by using our stairway!”

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་བཞི་འཁོར་དང་བཅས་པས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ལྷ་རྫས་ཀྱི་སྤུག་གི་ཐེམ་སྐས་ལྷ་རྫས་ཀྱི་གསེར་གྱི་ཕྱེ་མ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཁེབས་པ་དེ་ཉིད་དུ་སྤྲུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The four rulers of the asuras and their retinues also manifested for the Blessed One a stairway made of divine white coral and covered with bright divine golden powders.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཐུགས་བརྩེ་ནས་བདག་ཉིད་འདུན་པས་བདག་དང་འདྲ་བའི་སངས་རྒྱས་ཀྱི་སྐུ་དྲུག་སྤྲུལ་ནས་སངས་རྒྱས་བདུན་པོ་དེ་དག་ལྷའི་དབང་པོ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱི་མདུན་དུ་ཉན་ཐོས་ཀྱིས་མདུན་དུ་བདར་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་ནས་བཅོམ་ལྡན་འདས་བཀོད་པ་ཆེན་པོ་དེ་ལྟ་བུས་རི་རབ་ཀྱི་རྩེ་མོར་གཤེགས་སོ།
en: Out of affection for them, the Blessed One agreed, and so he emanated six buddhas similar to himself. Then, through this great display of the Blessed One, those seven buddhas, attended by hearers and surrounded by saṅghas of bodhisattvas, arrived at the summit of Mount Sumeru in front of all the rulers of the gods and the asuras.

source: །སངས་རྒྱས་བདུན་པོ་དེ་དག་མཆོག་ཏུ་ལྷན་ནེ་ལྷང་ངེར་རི་རབ་ཀྱི་རྩེ་མོ་ན་བཞུགས་སོ།
en: Those seven buddhas sat on the summit of Mount Sumeru, shining through their sublime brilliance and radiance.

source: །སངས་རྒྱས་ཀྱི་སྐུ་རེ་རེ་ལས་འོད་ཟེར་འདི་ལྟ་བུ་བྱུང་སྟེ། དཔེར་ན་ཟླ་བ་དང་ཉི་མ་བྱེ་བ་ཕྲག་སྟོང་ཤར་བ་བཞིན་ནོ།
en: From the bodies of each of those buddhas radiated light like the light emitted by ten billion suns and moons.

source: །ཀླུ་གང་དག་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་དུ་ལྷགས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་མཐོང་ནས་ལྟད་མོར་གྱུར་ཏེ་གཅིག་ལ་གཅིག་དྲིས་པ། སྣང་བ་ཆེན་པོའི་ནང་ན་རྟེན་པ་རི་རབ་ཀྱི་རྩེ་མོ་ལ་གནས་པ་བདུན་པོ་དེ་དག་ག་ལས་འོངས། དགའ་བོ་དང་ཉེ་དགའ་གཉིས་ཀྱིས་སྨྲས་པ། རི་རབ་རྩེ་ལ་ལྷ་རྣམས་ལྷན་ཅིག་ཚངས་པའི་མདུན་ན་འདོན་པ་འདི་གནས་པ།
en: When they saw this, all the nāgas who had assembled at the sacred site of wise sages became curious and asked one another, “Where do those seven beings who dwell within that brilliant light on the summit of Mount Sumeru come from?”

source: ཀུན་མཆོག་ལྷ་ཡི་དབང་ཕྱུག་ཤིན་ཏུ་མཁས་པ་རྣམས་ཀྱི་རིག་པའི་ཕ་རོལ་ཕྱིན། །བདག་ཅག་ལ་ནི་བརྩེ་བས་འདིར་གནས་དཔལ་གྱི་གཟི་བརྗིད་ཀྱིས་ནི་ལོངས་སྤྱོད་བྱེད། །འཆིང་བ་རྣམས་ལས་ཐར་བར་བྱེད་ཀྱིས་ཀུན་ཀྱང་དེ་ལ་མགོ་བོས་ཕྱག་འཚོལ་ཅིག །
en: Nanda and Upananda said, “Those who dwell on the summit of Mount Sumeru together with the gods come from the Priests of Brahmā. They are the most supreme divine lords and have perfected the knowledge of the wisest beings. They are dwelling there out of love for us, and they bring us delight through their glorious brilliance. They will liberate us from our bondages, so you should all pay homage to them!”

source: མ་དྲོས་པས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་འདི་མ་ཡིན་འདི་བདུད་སྡིག་ཅན་འགྲོ་གཙོ་འདོད་པའི་དབང་ཕྱུག་རྫུ་འཕྲུལ་ཅན། །ཁྱེད་ལ་སྙིང་བརྩེ་བ་ཡིས་བུ་དང་སྐྱེ་བོས་ཡོངས་བསྐོར་འདི་ནི་གནས་པ་ཡིས།
en: Anavatapta said, “It is not them! This is the evil Māra, the leader of beings, the lord of the desire realm gifted with magical powers. Out of affection for you, he is dwelling there surrounded by his sons and other beings.

source: །འདི་ནི་གང་ཞིག་ལ་ལ་འདོད་ཁམས་སྡུག་བསྔལ་བཀྲེས་ཤིང་སྐོམ་པའི་ནད་ཀྱིས་འཇིག །སེམས་ཅན་དེ་ཡང་རབ་ཏུ་ཐར་བྱེད་ཁྱེད་ཅག་མྱུར་དུ་སྡུག་བསྔལ་རྣམས་ལས་ཐར་བར་བྱེད།
en: He will liberate all the sentient beings who are afraid of the sufferings of the desire realm—hunger, thirst, and disease. He will quickly liberate you from your sufferings.”

source: །ས་ཡི་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་ལྟ་མ་ཡིན་འདིར་རྒྱལ་ལྷ་དབང་འཐབ་བྲལ་དགའ་ལྡན་འཕྲུལ་དགའ་གཞན་འཕྲུལ་བ། །
en: Lord of the Earth said, “It is not him! These are the Great Kings, the rulers of the gods, and the gods of the Heaven Free from Strife, the Heaven of Joy, the Heaven of Delighting in Emanations, and the Heaven of Making Use of Others’ Emanations.

source: དེ་དག་ཁྱེད་ལ་སྙིང་བརྩེ་བ་ཡིས་རི་ལ་གནས་ཤིང་ཀླུ་ཡི་ཚོགས་ལ་ལྟ། །
en: They are dwelling on that mountain out of affection for you, and they look upon our group of nāgas.

source: བདག་ཅག་ཡོངས་སུ་སྐྱོབས་ཞེས་ཀུན་གྱིས་གསང་མཐོར་དེ་དག་ལ་ནི་འོ་དོད་བོས། །དེ་དག་རྟག་ཏུ་བདེ་དང་ལྡན་པས་ཁྱེད་ཅག་བཙོན་ར་དག་ནས་ཞི་བར་བྱེད། །
en: We should all call to them for help and shout with loud voices, ‘Please protect us!’ Since they are constantly blissful, they will liberate you from your prisons.”

source: རྒྱ་མཚོས་སྨྲས་པ། དེ་དག་མ་ཡིན་འདི་ནི་ལྷ་དབང་བརྒྱ་བྱིན་ཚོགས་བཅས་གཟི་བརྗིད་ལྷང་ངེ་བ།
en: Sāgara said, “It is not them! This is the majestic and resplendent Śakra, lord of the gods, together with his retinue.

source: །དེ་ནི་གླིང་བཞིའི་ནང་ན་ཆོས་དང་ལྡན་པ་སུ་ཡོད་བརྩེ་བའི་ཡིད་ཀྱིས་བལྟ།
en: He looks lovingly upon all those within this four-continent world who are following the Dharma.

source: །ཁྱེད་ཅག་ཐམས་ཅད་བྱམས་པའི་ཡིད་དུ་གྱིས་ལ་ཁྲོ་བ་མྱུར་དུ་དོར་བར་གྱིས།
en: All of you, generate love in your minds and quickly let go of anger!

source: །དེ་ཡིས་མྱུར་དུ་ལག་འགྲོ་ཐར་བྱེད་འདི་ནས་འཇིགས་པ་ཀུན་ནས་ཐར་བར་བྱེད།
en: He will quickly liberate the nāgas—he will liberate you from this place and from all your fears.”

source: །ཤིན་ཏུ་བརྟན་གྱིས་སྨྲས་པ། དེ་ལྟ་མ་ཡིན་འདི་ཀུན་གཟུགས་བརྟེན་ལྷ་ཚོགས་བསམ་གཏན་བདེ་ལྡན་གཟི་བརྗིད་ཅན།
en: Supratiṣṭhita said, “It is not him! These are hosts of majestic gods from the form realms who are endowed with concentration and bliss.

source: །སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་དྲང་སྲོང་འདིར་འཛེགས་འཁོད་ནས་བརྩེ་བས་ཕྱོགས་རྣམས་སུ།
en: They have ascended this sacred site of wise sages for the sake of sentient beings, and they are now sitting here.

source: །མྱུར་དུ་སྲོག་ཆགས་རྣམས་ཀྱི་འགྲོ་བའི་སྡུག་བསྔལ་ཞི་བྱེད་ཆོས་ཆུའི་ཆར་པ་འབེབས།
en: Out of love, they will quickly pacify the suffering of beings in all directions and will shower down a rain of Dharma.

source: །ལྷ་ཡི་ཡིད་ཀྱིས་ཐམས་ཅད་དེ་ལ་ཕྱག་འཚོལ་འདི་ནས་བདག་ཅག་ཐར་བར་བྱེད།
en: All of you, pay homage to them with divine minds! They will liberate us from this place.”

source: །ཀླུ་ལུས་འབིགས་པའི་ཁབ་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འདི་ནི་གཟུགས་ན་བརྟེན་པའི་ལྷ་མིན་བཞི་པོ་འདི་ཀུན་བདུད་ཀྱི་འབྱོར་པ་ཡིན།
en: The nāga Body-Piercing Needle said, “These are not the gods of the form realms!

source: །ལུས་ངན་སྐྱེ་མཆོག་བདུད་རྩིའི་སྐོམ་དང་རྒྱུ་བར་བཏགས་པ་འདི་དག་གནས་པ་ནི།
en: These are the four demon leaders—Kubera, Supreme Being, Nectar Drink, and Bound in Movement.

source: །གནོད་སྦྱིན་སྡེ་དང་བཅས་པས་ཡོངས་བསྐོར་ཕྱོགས་བཞི་སྐྱོང་བྱེད་སྡིག་པའི་སྐྱེ་བོ་སྒྲོལ།
en: Surrounded by groups of yakṣas, they protect the four directions and free sinful beings.

source: །དེ་དག་གིས་ནི་བདག་ཅག་སེམས་ཅན་གཞན་མཐོང་འདི་ནས་མྱུར་དུ་ཐར་བར་བྱེད།
en: When they see our weak minds, they will quickly liberate us.”

source: །ཀླུ་རིན་ཆེན་སྐྱོང་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་དག་མ་ཡིན་དེ་ནི་མགོ་བྲེགས་ངུར་སྨྲིག་གོས་ཅན་འཁོད་པར་སྣང་བ་ཡིན།
en: The nāga Precious Protector said, “It is not them! They seem to be monks sitting there with shaved heads and saffron robes.

source: །དེ་དག་ལ་ནི་ཀུན་ལྟ་ཐལ་མོ་སྦྱར་འཁོད་སྐར་མའི་ནང་ན་ཟླ་བ་བཞིན།
en: All of you, look at them! They are sitting with their palms joined, like moons surrounded by stars.

source: །བདུན་པོ་དེ་དག་ཆེར་བསྒྲུབས་བརྟུལ་ཞུགས་བརྟན་པ་མགོ་བྲེགས་དག་གིས་མཐོང་བ་ཡིན།
en: I see those seven as monks with shaved heads who have reached great accomplishments and are steady in their spiritual observances.

source: །ངུར་སྨྲིག་གོས་བགོས་མཚན་གྱིས་རབ་བརྒྱན་འགྲོ་བ་ཀུན་གྱིས་མཆོད་པར་འོས་པར་མཐོང་།
en: I see those monks with saffron robes. They are adorned with the marks and worthy to be worshiped by all beings.”

source: །ཀླུ་ལུས་འབིགས་པའི་ཁབ་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འདི་ནི་བདག་ཉིད་ཀྱིས་ཀྱང་འཇིག་རྟེན་འདྲེན་པ་ཡིན་ཏེ་ང་ལ་དེ་ལྟར་སྣང་།
en: The nāga Body-Piercing Needle then said, “This is the great leader of the world himself! This is how it seems to me.

source: །སེམས་ཅན་རྣམས་ཀྱི་མཉམ་གཉེན་འགྲོ་བ་སྐྱོབ་པ་སྡུག་བསྔལ་རྒྱ་མཚོ་སེལ་བྱེད་པ།
en: He is the universal friend of sentient beings, the protector of beings who clears away the ocean of suffering.

source: །གང་དག་ལྷན་ཅིག་སྣང་བ་དྲང་སྲོང་གཞན་རྣམས་ཀྱང་ནི་དེ་ཡིས་སྤྲུལ་པ་ཡིན།
en: The other sages that appear together with him are his emanations.

source: །བདག་ཅག་ལ་ནི་བརྩེ་བས་འདིར་གནས་ཁྱེད་ཅག་སྡུག་བསྔལ་རྣམས་ལས་ཐར་བར་བྱེད།
en: He is dwelling there out of love for us, and he will liberate you from your sufferings.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རི་རབ་ཀྱི་རྩེ་མོ་དེ་ལ་བཞུགས་མ་ཐག་ཏུ་རི་རབ་དཔག་ཚད་བརྒྱད་ཅུ་རྩ་བཞིར་འཁོར་བརྒྱ་སྟོང་ཡོད་པར་གྱུར་ཏོ།
en: As soon as the Blessed One sat down on the summit of Mount Sumeru, a hundred thousand retinues took place along eighty-four leagues of that mountain.

source: །དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་སྟེང་དུ་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་འོག་མིན་གྱི་ལྷའི་གནས་ལ་ཐུག་པའི་བར་མན་ཆད་སྣ་ཚོགས་པ།
en: Above the Blessed One, the gods of the desire and form realms emanated a storied mansion made of the divine seven precious substances that stretched all the way up to the divine abode of the Highest Heaven.

source: བལྟ་ན་སྡུག་པ། དཔག་ཚད་བརྒྱ་སྟོང་དུ་མར་སྤྲས་པ་དེ་སྲིད་ཅིག་སྤྲུལ་ཏེ།
en: It was multicolored, delightful to behold, and adorned all along its many hundreds of thousands of leagues.

source: དེ་ནི་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ལྷ་རྫས་ཀྱི་རས་བཅོས་བུ་དང་། ཆོས་གོས་དང་། རྒྱན་དང་། སྦུད་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སྤོས་དང་། མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་ཤིན་ཏུ་བརྒྱན་པར་སྤྲུལ་པ་ཡིན་ནོ།
en: To worship the Blessed One, they also manifested a variety of divine fabrics, ornaments, embroideries, parasols, banners, flags, perfumes, and flowers to adorn him.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལ་བོས་ཏེ་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ནི་ང་དང་། སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། དྲང་སྲོང་རྣམས་དང་། བདུད་རྣམས་དང་། དབང་ཆེ་བར་གྲགས་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་རྣམས་དང་། མི་དང་། མི་མ་ཡིན་པ་རྣམས་ཀྱིས་ཤིན་ཏུ་ལོངས་སྤྱད་ཟིན་ཏོ།
en: Then, the Blessed One summoned Śakra, lord of the gods, and said to him, “Kauśika, I, buddhas, bodhisattva great beings, great hearers, sages, māras, gods renowned for their great power, nāgas, yakṣas, humans, and nonhumans have resided in the buddha realm of Sahā.

source: །དེ་བཞིན་དུ་ད་ལྟར་རི་རབ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་ཤིན་ཏུ་ལོངས་སྤྱད་ཟིན་ཏེ། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ལྷ་དབང་ཆེ་བར་གྲགས་པ་རྣམས་ཀྱིས་ཤིན་ཏུ་ལོངས་སྤྱད་ཟིན་ཏོ། །རི་རབ་ཀྱི་རྩེ་མོ་ན་གནས་པའི་འབྱུང་པོ་ཁྱེད་ལ་ཕན་པ་དང་བདེ་བར་གྱུར་ཅིག །
en: Similarly, the Thus-Gone One himself now resides here on Mount Sumeru, as do those bodhisattva great beings who have come from all the buddha realms of the ten directions and those gods renowned for their great power. May the beings residing on the summit of Mount Sumeru bring you welfare and happiness!”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་ཅག་ལ་ཐུགས་བརྩེ་བར་མཛད་ན་བཙུན་པ་བཅོམ་ལྡན་འདས། བཅོམ་ལྡན་འདས་ལ་ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། རི་རབ་ལ་ལོངས་སྤྱད་པར་བགྱི་བའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདི་ཐམས་ཅད་ན་གལ་ཏེ་ཡང་གང་སུ་དག་བདུད་དམ། བརྒྱ་བྱིན་ནམ། ཚངས་པའམ། ལྷའི་དབང་པོའམ། ཀླུའི་དབང་པོའམ། གནོད་སྦྱིན་གྱི་དབང་པོའམ། དྲི་ཟའི་དབང་པོའམ། ལྷ་མ་ཡིན་གྱི་དབང་པོའམ། ནམ་མཁའ་ལྡིང་གི་དབང་པོའམ། མི་འམ་ཅིའི་དབང་པོའམ། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའམ། སེམས་ཅན་དབང་ཆེ་བར་གྲགས་པ། དབང་ཆེ་བར་གྲགས་པ་ལྷའི་དྲང་སྲོང་གི་བར་ཞེས་བགྱི་བ་ནས་མིའི་དྲང་སྲོང་གི་བར་དེ་དག་ཐམས་ཅད་འདིར་ལྷགས་པར་གྱུར་ན་འདིར་བདག་ཅག་ལ་ཤས་ཆེར་ཕན་པ་དང་བདེ་བར་འགྱུར་ལགས་སོ།
en: Śakra replied, “Respected Blessed One, since you act out of affection for us, and since all of us—māras, Śakra, Brahmā, lords of the gods, lords of the nāgas, lords of the yakṣas, lords of the gandharvas, lords of the asuras, lords of the garuḍas, lords of the kinnaras, lords of the mahoragas, sentient beings renowned for great power, divine sages, and human sages—have assembled here in this buddha realm of Sahā to pay homage to the Blessed One, revere him, and bring him enjoyment as he resides on Mount Sumeru, we will all meet with great welfare and happiness here!”
